Repository: om1cael/Hidroly
Catalog: lib/l10n/app_*.arb
Languages: de

# addAction
source: Add
de: Hinzufügen

# cancelAction
source: Cancel
de: Abbrechen

# deleteAction
source: Delete
de: Löschen

# doNotSaveLabel
source: Do not save
de: Nicht speichern

# editAction
source: Edit
de: Bearbeiten

# updateAction
source: Update
de: Aktualisieren

# manageAction
source: Manage
de: Verwalten

# bottomNavHomeLabel
source: Home
de: Start

# bottomNavSummaryLabel
source: Summary
de: Übersicht

# customCupButton
source: Custom
de: Benutzerdefiniert

# customCupDialogTextFieldAmount
source: Amount
de: Menge

# customCupDialogTitle
source: Add Custom Cup
de: Benutzerdefiniertes Glas Hinzufügen

# editCustomCupDialogTitle
source: Edit custom cup
de: Benutzerdefiniertes Glas bearbeiten

# editCustomCupFailed
source: It was not possible to edit your cup. Please, report it on GitHub and reference code 'ECE01'.
de: Es war nicht möglich dieses Glas zu bearbeiten. Bitte melde dies auf GitHub und referenziere den Code 'ECE01'.

# editCustomCupSuccess
source: Cup edited successfully!
de: Glas erfolgreich bearbeitet!

source: Daily goal
de: Tagesziel

# dailyGoalUpdated
source: Daily goal saved successfully
de: Tagesziel erfolgreich gespeichert

# dayHistoryBottomSheetItemSubtitle
source: added {time}
de: hinzugefügt um {time}Uhr

# dayHistoryBottomSheetNoItems
source: Nothing here :(
de: Hier ist nichts :(

# dayHistoryBottomSheetTitle
source: Day history
de: Tagesverlauf

# dayLoadingFailed
source: Day not found
de: Tag nicht gefunden

# notificationTaskCreationFailed
source: Failed to create the notification task
de: Beim erstellen der Benachrichtungsaufgabe ist ein Fehler aufgetreten

# pageNotAvailableDescription
source: Sorry, this page isn't available yet :(
de: Entschuldigung, diese Seite ist noch nicht verfügbar :(

# pageNotAvailableTitle
source: Not Available
de: Nicht verfügbar

# setupFailed
source: An error occurred. Please create a GitHub issue and reference code 'SE01'.
de: Ein Fehler ist aufgetreten. Bitte erstelle einen GitHub issue und referenziere den Code 'SE01'.

# sleepScheduleEditFailed
source: Could not save your sleep schedule
de: Schlafplan konnte nicht gespeichert werden

# textFieldAmountError
source: Invalid Amount
de: Ungültige Menge

source: Value not supported
de: Wert nicht unterstützt

# waterAddFailed
source: Oops! Couldn't add your water. Try again?
de: Hoppla! Das Wasser konnte nicht hinzugefügt werden. Nochmal versuchen?

# homePageTodayAppBarTitle
source: Today
de: Heute

# notificationSetupDescription
source: Let's adjust notifications to match your day
de: Lass uns die Benachrichtigungen an deinen Tag anpassen

# notificationSetupTitle
source: Notifications
de: Benachrichtigungen

# notificationsSettingsSleep
source: You sleep at
de: Du schläfst ein um

# notificationsSettingsWakeUp
source: You wake up at
de: Du wachst auf um

# reminderNotificationBody
source: Keep your body happy, take a sip!
de: Mache deinen Körper glücklich, trink einen Schluck!

# reminderNotificationTitle
source: ðŸ’§ Time to hydrate!
de: 💧 Zeit etwas zu trinken!

# progressCircleOf
source: of
de: von

# settingsAboutSection
source: About
de: Über

# settingsContribute
source: Contribute
de: Beitragen

# settingsContributeDescription
source: Access the GitHub repository
de: GitHub repository öffnen

# settingsFeedback
source: Send feedback
de: Feedback geben

# settingsFeedbackDescription
source: Share your thoughts with us
de: Teile uns deine Meinung mit

# settingsGeneralSection
source: General
de: Allgemein

# settingsPageTitle
source: Settings
de: Einstellungen

# settingsSetCustomDailyGoal
source: Set a custom daily goal
de: Benutzerdefiniertes Tagesziel setzen

# settingsSleepSchedule
source: Edit sleep schedule
de: Schlafplan bearbeiten

# settingsSleepScheduleAppBar
source: Edit sleep schedule
de: Schlafplan bearbeiten

# settingsSleepScheduleDescription
source: Help us with a few details so we can update your sleep schedule
de: Hilf uns mit ein paar Details, damit wir deinen Schlafplan aktualisieren können

# settingsSleepScheduleTitle
source: Sleep Schedule
de: Schlafplan

# settingsUnitSystem
source: Unit system
de: Einheitensystem

# settingsUpdateDailyGoalAppBar
source: Update Goal
de: Tagesziel aktualisieren

# settingsUpdateDailyGoalDescription
source: Help us with a few details so we can update your goal
de: Hilf uns mit ein paar Details, damit wir dein Tagesziel zu aktualisieren können

# settingsUpdateDailyGoalTitle
source: Daily Goal
de: Tagesziel

# settingsUpdateYourDailyGoal
source: Update your daily goal
de: Tagesziel aktualisieren

# settingsYouSection
source: You
de: Du

# settingsNotificationsSection
source: Notifications
de: Benachrichtigungen

# settingsNotificationsManageDescription
source: Toggle notifications
de: Benachrichtigungen umschalten

# settingsNotificationsSleepScheduleDescription
source: Wake/sleep times & frequency
de: Weck-/Schlafzeiten & Regelmäßigkeit

# settingsNotificationsFrequency
source: Frequency
de: Regelmäßigkeit

# settingsTheme
source: Theme
de: Aussehen

# setupAgeTextFieldInvalidValue
source: Age between 10 and 120
de: Alter zwischen 10 und 120

# setupAgeTextFieldLabel
source: Your age
de: Dein Alter

# setupDataText
source: Your data is stored on your device.
de: Deine Daten werden auf deinem Gerät gespeichert.

# setupWeightTextFieldInvalidWeight
source: Weight between {minWeight} and {maxWeight}
de: Gewicht zwischen {minWeight} und {maxWeight}

# setupWeightTextFieldLabel
source: Your weight
de: Dein Gewicht

# setupWelcomeSubtitle
source: We just need to set things up. It will be quick and easy!
de: Wir müssen nur noch ein paar Einstellungen vornehmen. Das wird schnell und einfach gehen!

# setupWelcomeTitle
source: Welcome
de: Willkommen

source: Metric
de: Metrisch

# minutes
source: {time} minutes
de: {time} Minuten

# hour
source: {time} hour
de: Stunde {time}

# hours
source: {time} hours
de: {time} Stunden

source: Light
de: Hell

source: Dark
de: Dunkel
